/*
*  2019 
*/
package test;

/**
 * @author wangdan Date: 2019/4/22 Time: 17:57
 * @version $Id$
 */
public class Demo70 {

    public static void main(String[] args) {
        String str = "{\"category\":\"City\",\"text\":\"根据《上海市公共场所控制吸烟条例》，从2017年3月1日起，酒店不能安排吸烟房，并禁止在酒店室内区域吸烟。\"},{\"cat\n" +
                "egory\":\"Hotel\",\"channel\":\"A\",\"end\":\"2020-12-31\",\"start\":\"2018-07-04\",\"text\":\"每月1日清洗游泳池，泳池关闭.\"},{\"category\":\"FGRooms\",\"channe\n" +
                "l\":\"A\",\"end\":\"2020-12-31\",\"start\":\"2019-02-15\",\"text\":\"酒店商务中心可提供迪士尼乐园当日门票售卖、VIP免排队等服务，详情咨询酒店商务中心，\n" +
                "询电话50202566 酒店提供迪士尼无偿班车接送；请在办理入住时，凭房卡至商务中心预约。\\r\\n\"},{\"category\":\"FGRooms\",\"channel\":\"A\",\"end\":\"2020-1\n" +
                "2-31\",\"start\":\"2019-03-18\",\"text\":\"浦东机场接送时间为早上 7:05至晚上23:05点，每两小时一班，请提前一天预约。免费接送机班车上下客地点：上海\n" +
                "浦东国际机场2号航站楼P2停车场1层H区H 8区域。 酒店商务中心可提供迪士尼乐园当日门票售卖、VIP免排队等服务，详情咨询酒店商务中心，咨询电话502\n" +
                "02566 酒店提供迪士尼无偿班车接送；请在办理入住时，凭房卡至商务中心预约。\"},{\"category\":\"PPRooms\",\"channel\":\"A\",\"end\":\"2020-12-31\",\"start\"\n" +
                ":\"2019-02-15\",\"text\":\"酒店商务中心可提供迪士尼乐园当日门票售卖、VIP免排队等服务，详情咨询酒店商务中心，咨询电话50202566 酒店提供迪士尼无\n" +
                "班车接送；请在办理入住时，凭房卡至商务中心预约。\"},{\"category\":\"PPRooms\",\"channel\":\"A\",\"end\":\"2020-12-31\",\"start\":\"2019-02-15\",\"text\":\"浦\n" +
                "东机场接送时间为早上 11:05至晚上23:05点，每两小时一班，请提前一天预约。免费接送机班车上下客地点：上海浦东国际机场2号航站楼P2停车场1层H区H\n" +
                " 8区域。 酒店商务中心可提供迪士尼乐园当日门票售卖、VIP免排队等服务，详情咨询酒店商务中心，咨询电话50202566 酒店提供迪士尼无偿班车接送；请\n" +
                "在办理入住时，凭房卡至商务中心预约。\"}";

        System.out.println(str.length());
        String  ss= str.replaceAll("\\\\r","");
        String ss1 = str.replace("\\r","");
        System.out.println(ss.length());
        System.out.println(ss1.length());
    }
}